# 1. Вывести на экран строку "Hello world"
print('Hello World')

# 2. Вывести на экран пять звездочек (*)
print('*****')
print('*'*5)
print()

# 3. Вывести на экран квадрат 5 на 5 заполненный символами '#'
print('#####\n#####\n#####\n#####\n#####')
print()
print(('#'*5 + '\n')*5)
